#### SetSegments Method

---

|  |
| --- |
| FillGrid Class   See Also |

Sets the segments to the fill grid.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public void SetSegments( 	IList<double> segArr ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetSegments ( _ 	segArr As IList(Of Double) _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetSegments( 	IList<double>^ segArr ) ``` |

#### Parameters

segArr
:   Type:  System.Collections.Generic IList   Double
     The segments to be used.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

FillGrid Class

Autodesk.Revit.DB Namespace